# WinderRunWidthLessThanWalkLineOffsetFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderRunWidthLessThanWalkLineOffsetFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The value for Run Width is less than two times of value of the inside walkline offset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderRunWidthLessThanWalkLineOffsetFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderRunWidthLessThanWalkLineOffsetFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderRunWidthLessThanWalkLineOffsetFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace